In [1]:
import requests
import pandas as pd
import json
from bs4 import BeautifulSoup
import time
import datetime

In [2]:
HEADERS = ({
    'User-Agent':'Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/44.0.2403.157 Safari/537.36',
    'Accept-Language': 'en-US, en;q=0.5'
})

In [3]:
def get_body(url):
    page = requests.get(url,headers=HEADERS)
    return BeautifulSoup(page.content, 'html.parser')

# 1. Write a python program to display all the header tags from ‘en.wikipedia.org/wiki/Main_Page’.

### There is no "Header Tags" on the this web page I'm considering "Header Tags" Means all the "Heading Tag" (H1 to H6)

In [4]:
url = 'https://en.wikipedia.org/wiki/Main_Page'
body = get_body(url)

In [5]:
h_list = []
for i in range(1,7):
    h_list.append([one.text for one in body.findAll(f'h{i}') ])
all_headers = pd.DataFrame(h_list).T
all_headers.columns = [ f'h{i}' for i in range(1,7)]

In [6]:
all_headers

,h1,h2,h3,h4,h5,h6
0,Main Page,From today's featured article,Personal tools\n,None,None,None
1,None,Did you know ...,Namespaces\n,None,None,None
2,None,In the news,Variants\n,None,None,None
3,None,On this day,Views\n,None,None,None
4,None,Today's featured picture,More\n,None,None,None
5,None,Other areas of Wikipedia,\nSearch\n,None,None,None
6,None,Wikipedia's sister projects,Navigation\n,None,None,None
7,None,Wikipedia languages,Contribute\n,None,None,None
8,None,Navigation menu,Tools\n,None,None,None
9,None,None,Print/export\n,None,None,None
10,None,None,In other projects\n,None,None,None
11,None,None,Languages\n,None,None,None

# 2. Write a python program to display IMDB’s Top rated 100 movies’ data (i.e. Name, IMDB rating, Year of release).

In [7]:
url = 'https://www.imdb.com/chart/top?ref_=nv_mv_250'

In [8]:
all_divs = get_body(url).find_all('tr')

In [9]:
final_list = []
for i,one_div in enumerate(all_divs):
    if i == 0 :
        continue
    if i == 101:
        break
        
    title_column = one_div.find('td',{'class','titleColumn'})
    year = title_column.find('span').text.replace('(','').replace(')','')
    name = title_column.find('a').text
    rating = one_div.find('td',{'class','ratingColumn'}).find('strong').text
    final_list.append({'year':year,'name':name,'rating':rating})
    
final_df = pd.DataFrame(final_list)
final_df

    year                                   name rating
0   1994               The Shawshank Redemption    9.2
1   1972                          The Godfather    9.1
2   1974                 The Godfather: Part II    9.0
3   2008                        The Dark Knight    9.0
4   1957                           12 Angry Men    8.9
..   ...                                    ...    ...
95  2012                               The Hunt    8.3
96  2000                    Requiem for a Dream    8.3
97  1952                    Singin' in the Rain    8.3
98  1959                     North by Northwest    8.3
99  2004  Eternal Sunshine of the Spotless Mind    8.3

[100 rows x 3 columns]

# 3. Write a python program to display IMDB’s Top rated 100 Indian movies’ data (i.e. Name, IMDB rating, Year of release)

In [10]:
url = 'https://www.imdb.com/india/top-rated-indian-movies/'

In [11]:
all_divs = get_body(url).find_all('tr')
final_list = []
for i,one_div in enumerate(all_divs):
    if i == 0 :
        continue
    if i == 101:
        break
        
    title_column = one_div.find('td',{'class','titleColumn'})
    year = title_column.find('span').text.replace('(','').replace(')','')
    name = title_column.find('a').text
    rating = one_div.find('td',{'class','ratingColumn'}).find('strong').text
    final_list.append({'year':year,'name':name,'rating':rating})
    
final_df = pd.DataFrame(final_list)
final_df

    year                               name rating
0   1987                            Nayakan    8.5
1   2003                         Anbe Sivam    8.5
2   2018                  Pariyerum Perumal    8.5
3   1979                        Hanky Panky    8.5
4   2018                  C/o Kancharapalem    8.5
..   ...                                ...    ...
95  2004                          Virumandi    8.1
96  2001  Lagaan: Once Upon a Time in India    8.1
97  2012                            Kahaani    8.1
98  1994                    Andaz Apna Apna    8.1
99  2018           Uri: The Surgical Strike    8.1

[100 rows x 3 columns]

# 4. Write a python program to scrap book name, author name, genre and book review of any 5 books from ‘www.bookpage.com’

In [12]:
url = 'https://bookpage.com/reviews'

In [13]:
all_boxs = get_body(url).find_all('div',{'class','article-row'})

In [14]:
all_books = []
for i,one_box in enumerate(all_boxs):
    if i == 5:
        break
        
    book_name = one_box.find('h4').find('a').text
    author_name = one_box.find('p',{'class','sans'}).text
    genre = one_box.find('p',{'class','hidden-phone'}).text.replace('\n','')
    book_review = one_box.find('p',{'class','excerpt'}).text
    all_books.append({
        'book_name': book_name,'author_name': author_name,'genre': genre,'book_review': book_review
    })
    
book_df = pd.DataFrame(all_books)
book_df

,book_name,author_name,genre,book_review
0,★ You Are Your Best Thing,"\nTarana Burke, Brené Brown, Cast\n",Audio / Nonfiction / Essays,\nTarana Burke and Brené Brown demonstrate the...
1,Beyond the Mapped Stars,\nRosalyn Eves\n,YA / YA Fiction,\nRosalyn Eves’ Beyond the Mapped Stars blends...
2,★ Gordo,\nJaime Cortez\n,Fiction / Short Stories,"\nAs in John Steinbeck’s The Grapes of Wrath, ..."
3,★ Two-Way Mirror,\nFiona Sampson\n,Nonfiction / Biography / Literary History,\nPeople often think of Elizabeth Barrett Brow...
4,Velvet Was the Night,\nSilvia Moreno-Garcia\n,Fiction / Noir,"\nFor her next trick, Silvia Moreno-Garcia mov..."

# 5. Write a python program to scrape cricket rankings from ‘www.icc-cricket.com’. You have to scrape:

## i) Top 10 ODI teams in men’s cricket along with the records for matches, points and rating.

In [15]:
url = 'https://www.icc-cricket.com/rankings/mens/team-rankings/odi'

In [16]:
all_boxs = get_body(url).find('table').find('tbody').find_all('tr')

In [17]:
# Looping data to get info
all_data = []
for i, one_box in enumerate(all_boxs):
    
    # top 10 teams
    if i == 10 :
        break 
        
    team = one_box.find('span',{'class','u-hide-phablet'}).text
    tds = one_box.find_all('td')
    match = tds[2].text
    point = tds[3].text
    rating = tds[4].text.strip()
    all_data.append({'team': team, 'match': match, 'point': point, 'rating': rating})
team_df = pd.DataFrame(all_data)
team_df

           team match  point rating
0   New Zealand    17  2,054    121
1       England    32  3,793    119
2     Australia    28  3,244    116
3         India    32  3,624    113
4  South Africa    22  2,267    103
5      Pakistan    27  2,524     93
6    Bangladesh    29  2,639     91
7   West Indies    30  2,523     84
8     Sri Lanka    29  2,303     79
9   Afghanistan    17  1,054     62

## ii) Top 10 ODI Batsmen in men along with the records of their team and rating.

In [18]:
url = 'https://www.icc-cricket.com/rankings/mens/player-rankings/odi/batting'

In [19]:
all_boxs = get_body(url).find('table').find_all('tr')

In [20]:
# Looping data to get info
all_data = []
for i, one_box in enumerate(all_boxs):
    
    # skiping heading
    if i == 0:
        continue
    
    
    # top 10 teams
    if i == 11:
        break 
    
    tds = one_box.find_all('td')
    
    player = tds[1].text.replace('\n','')
    country = tds[2].text.replace('\n','')
    point = tds[3].text.replace('\n','')
    all_data.append({ 'player': player, 'point': point, 'country': country})
    
player_df = pd.DataFrame(all_data)
player_df

            player point country
0       Babar Azam   873     PAK
1      Virat Kohli   844     IND
2     Rohit Sharma   813     IND
3      Ross Taylor   801      NZ
4      Aaron Finch   779     AUS
5   Jonny Bairstow   775     ENG
6     David Warner   762     AUS
7  Quinton de Kock   758      SA
8        Shai Hope   758      WI
9  Kane Williamson   754      NZ

## iii) Top 10 ODI bowlers along with the records of their team and rating.

In [21]:
url = 'https://www.icc-cricket.com/rankings/mens/player-rankings/odi/bowling'

In [22]:
all_boxs = get_body(url).find('table').find_all('tr')

In [23]:
# Looping data to get info
all_data = []
for i, one_box in enumerate(all_boxs):
    
    # skiping heading
    if i == 0:
        continue
    
    
    # top 10 teams
    if i == 11:
        break 
    
    tds = one_box.find_all('td')
    
    player = tds[1].text.replace('\n','')
    country = tds[2].text.replace('\n','')
    point = tds[3].text.replace('\n','')
    all_data.append({ 'player': player, 'point': point, 'country': country})
    
player_df = pd.DataFrame(all_data)
player_df

             player point country
0       Trent Boult   737      NZ
1    Josh Hazlewood   709     AUS
2  Mujeeb Ur Rahman   708     AFG
3      Chris Woakes   700     ENG
4      Mehedi Hasan   692     BAN
5        Matt Henry   691      NZ
6    Jasprit Bumrah   679     IND
7    Mitchell Starc   652     AUS
8   Shakib Al Hasan   650     BAN
9     Kagiso Rabada   648      SA

# 6. Write a python program to scrape cricket rankings from ‘www.icc-cricket.com’. You have to scrape:

## i) Top 10 ODI teams in women’s cricket along with the records for matches, points and rating.

In [24]:
url = 'https://www.icc-cricket.com/rankings/womens/team-rankings/odi'

In [25]:
all_boxs = get_body(url).find('table').find('tbody').find_all('tr')

In [26]:
# Looping data to get info
all_data = []
for i, one_box in enumerate(all_boxs):
    
    # top 10 teams
    if i == 10 :
        break 
        
    team = one_box.find('span',{'class','u-hide-phablet'}).text
    tds = one_box.find_all('td')
    match = tds[2].text
    point = tds[3].text
    rating = tds[4].text.strip()
    all_data.append({'team': team, 'match': match, 'point': point, 'rating': rating})
team_df = pd.DataFrame(all_data)
team_df

           team match  point rating
0     Australia    18  2,955    164
1       England    20  2,370    119
2  South Africa    24  2,828    118
3         India    23  2,535    110
4   New Zealand    21  1,947     93
5   West Indies    17  1,427     84
6      Pakistan    20  1,496     75
7    Bangladesh     5    306     61
8     Sri Lanka    11    519     47
9       Ireland     2     25     13

## ii) Top 10 women’s ODI players along with the records of their team and rating.

In [27]:
url = 'https://www.icc-cricket.com/rankings/womens/player-rankings/odi/batting'

In [28]:
all_boxs = get_body(url).find('table').find_all('tr')

In [29]:
# Looping data to get info
all_data = []
for i, one_box in enumerate(all_boxs):
    
    # skiping heading
    if i == 0:
        continue
    
    
    # top 10 teams
    if i == 11:
        break 
    
    tds = one_box.find_all('td')
    
    player = tds[1].text.replace('\n','')
    country = tds[2].text.replace('\n','')
    point = tds[3].text.replace('\n','')
    all_data.append({ 'player': player, 'point': point, 'country': country})
    
player_df = pd.DataFrame(all_data)
player_df

              player point country
0        Mithali Raj   762     IND
1        Lizelle Lee   758      SA
2       Alyssa Healy   756     AUS
3     Tammy Beaumont   754     ENG
4    Stafanie Taylor   736      WI
5        Meg Lanning   723     AUS
6  Amy Satterthwaite   715      NZ
7     Natalie Sciver   706     ENG
8    Smriti Mandhana   701     IND
9    Laura Wolvaardt   683      SA

## iii) Top 10 women’s ODI all-rounder along with the records of their team and rating.

In [30]:
url = 'https://www.icc-cricket.com/rankings/womens/player-rankings/odi/all-rounder'

In [31]:
all_boxs = get_body(url).find('table').find_all('tr')

In [32]:
# Looping data to get info
all_data = []
for i, one_box in enumerate(all_boxs):
    
    # skiping heading
    if i == 0:
        continue
    
    
    # top 10 teams
    if i == 11:
        break 
    
    tds = one_box.find_all('td')
    
    player = tds[1].text.replace('\n','')
    country = tds[2].text.replace('\n','')
    point = tds[3].text.replace('\n','')
    all_data.append({ 'player': player, 'point': point, 'country': country})
    
player_df = pd.DataFrame(all_data)
player_df

             player point country
0    Marizanne Kapp   418      SA
1      Ellyse Perry   418     AUS
2   Stafanie Taylor   394      WI
3    Natalie Sciver   365     ENG
4     Deepti Sharma   331     IND
5     Jess Jonassen   307     AUS
6  Ashleigh Gardner   252     AUS
7  Dane van Niekerk   243      SA
8     Sophie Devine   242      NZ
9   Katherine Brunt   239     ENG

# 7. Write a python program to scrape details of all the mobile phones under Rs. 20,000 listed on Amazon.in. The scraped data should include Product Name, Price, Image URL and Average Rating.

In [33]:
url = 'https://www.amazon.in/s?k=all+the+mobile+phones+under+Rs.+20%2C000&ref=nb_sb_noss'

is_next = True
final_product_list = []
i = 1

while is_next:
    

    all_mobile_data = get_body(url)

    all_boxs = all_mobile_data.find_all('div',{'class':['s-result-item','s-asin']})

    
    # Find all the data of the currecnt page
    for one_box in all_boxs:
        try:
            inner_box = one_box.find('div',{'class':['a-section','a-spacing-medium']})

            product_name = inner_box.find('h2').find('span').text

            price = inner_box.find_all('div',{'class','sg-col-inner'})[1] \
                            .find('div',{'class','sg-row'}) \
                            .find('div',{'class','a-spacing-top-small'}) \
                            .find_all('span')[1].text

            if '₹' not in price:
                price = inner_box.find_all('div',{'class','sg-col-inner'})[1] \
                            .find('div',{'class','sg-row'}) \
                            .find('div',{'class','a-spacing-top-small'}) \
                            .find('span',{'class','a-offscreen'}).text

            image = inner_box.find('img')['src']
            average_rating = inner_box.find('i').find('span').text.split(' out of 5 stars')[0]

            final_product_list.append({
                'product_name': product_name, 
                'price': price, 
                'image': image, 
                'average_rating': average_rating
            })
        except Exception as e:
            continue
            
           
    # move to the next page
    
    i += 1
    try:
        a_pagination = all_mobile_data.find('ul',{'class','a-pagination'})
        s_pagination_item = all_mobile_data.find('a',{'class':['s-pagination-item','s-pagination-button']})
        try:
            if a_pagination != None:
                sub_url = all_mobile_data.find('ul',{'class','a-pagination'}).find("a", string=str(i))['href']
            elif s_pagination_item != None:
                find_element = all_mobile_data.find('a',{'class':['s-pagination-item','s-pagination-button']}).text
                if 'Previous' in find_element:
                    find_element = all_mobile_data.find_all('a',{'class':['s-pagination-item','s-pagination-button']})
                sub_url = all_mobile_data.find('a',{'class':['s-pagination-item','s-pagination-button']}).find_all("a", string=str(i))['href']

        except Exception as e1:
            sub_urls = all_mobile_data.find('a',{'class':['s-pagination-item','s-pagination-button']}).find_all("a", string=str(i))
            
        url = 'https://www.amazon.in' + sub_url
        
        is_next = True
    except Exception as e:
        is_next = False
        
pd.DataFrame(final_product_list)

,product_name,price,image,average_rating
0,"Panasonic Eluga i7 (2GB RAM, 16GB Storage, Fin...","₹5,798",https://m.media-amazon.com/images/I/41QsvcpKaZ...,3.1
1,"Redmi Note 10S (Frost White, 6GB RAM, 64GB Sto...","₹14,999",https://m.media-amazon.com/images/I/81SJHWh-df...,4.1
2,"OnePlus Nord CE 5G (Charcoal Ink, 8GB RAM, 128...","₹24,999",https://m.media-amazon.com/images/I/71LRBr1aLN...,4.1
3,"Redmi 9A (Nature Green, 2GB RAM, 32GB Storage)...","₹6,999",https://m.media-amazon.com/images/I/71sxlhYhKW...,4.2
4,"Redmi 9 (Sky Blue, 4GB RAM, 64GB Storage) | 2....","₹8,999",https://m.media-amazon.com/images/I/71A9Vo1Bat...,4.2
5,"Samsung Galaxy M51 (Celestial Black, 6GB RAM, ...","₹19,999",https://m.media-amazon.com/images/I/713AhSUtbH...,4.4
6,"Samsung Galaxy M51 (Electric Blue, 8GB RAM, 12...","₹21,999",https://m.media-amazon.com/images/I/710weRkP-n...,4.4
7,"Redmi Note 9 (Pebble Grey, 4GB RAM 64GB Storag...","₹11,999",https://m.media-amazon.com/images/I/71X5I1cVfb...,4.3
8,"Vivo V21e 5G (Dark Pearl, 8GB RAM, 128GB Stora...","₹24,990",https://m.media-amazon.com/images/I/61fCg27sbP...,4.1
9,"Samsung Galaxy A22 (Black, 6GB RAM, 128GB Stor...","₹18,499",https://m.media-amazon.com/images/I/81Gc-sol2J...,4.1
10,"Oppo A31 (Fantasy White, 6GB RAM, 128GB Storag...","₹12,490",https://m.media-amazon.com/images/I/61CnyJ-IbM...,4.2
11,"Oppo A31 (Mystery Black, 6GB RAM, 128GB Storag...","₹12,490",https://m.media-amazon.com/images/I/71KCwNV6Mu...,4.2
12,"Vivo Y12s (Phantom Black, 3GB, 32GB ) with No ...","₹10,990",https://m.media-amazon.com/images/I/71UAi2jwsN...,4.2
13,"Samsung Galaxy M11 (Black, 4GB RAM, 64GB Stora...","₹9,999",https://m.media-amazon.com/images/I/710jkZNub3...,4.1
14,"Redmi Note 10 (Aqua Green, 4GB RAM, 64GB Stora...","₹13,499",https://m.media-amazon.com/images/I/810GQ7CWdD...,4.1
15,"OPPO A31 (Mystery Black, 4GB RAM, 64GB Storage...","₹10,990",https://m.media-amazon.com/images/I/71KCwNV6Mu...,4.2
16,"OPPO A31 (Fantasy White, 4GB RAM, 64GB Storage...","₹10,990",https://m.media-amazon.com/images/I/61CnyJ-IbM...,4.2
17,"Redmi 9 Prime (Space Blue, 4GB RAM, 64GB Stora...","₹10,799",https://m.media-amazon.com/images/I/71U2SiHgbi...,4.3
18,Samsung Galaxy M21 2021 Edition (Charcoal Blac...,"₹12,499",https://m.media-amazon.com/images/I/712+A5mH44...,4.2

# 8. Write a python program to extract information about the local weather from the National Weather Service website of USA, https://www.weather.gov/ for the city, San Francisco. You need to extract data about 7 day extended forecast display for the city. The data should include period, short description, temperature and description

In [34]:
url = 'https://forecast.weather.gov/MapClick.php?lat=37.777120000000025&lon=-122.41963999999996#.YRzDFHUzZNg'

In [35]:
forecast_boxs = get_body(url).find_all('div',{'class':'row-forecast'})

In [36]:
now = datetime.datetime.now()

In [37]:
all_day_name = []
for i in range(0,6):
    all_day_name.append((now + datetime.timedelta(days=i)).strftime("%A"))

In [38]:
final_data = []
for i, one_box in enumerate(forecast_boxs):
    
    forecast_label = one_box.find('div',{'class':'forecast-label'}).text 
    forecast_text = one_box.find('div',{'class':'forecast-text'}).text 
    
    if i == 0:
        period = 'Today'
    elif forecast_label in all_day_name:
        period = forecast_label
    else:
        continue
        
    sort_desc = forecast_text.split('.')[0]
    temprature = forecast_text.split(', with a ')[1].split('.')[0][-2:]    
    description = forecast_text
    final_data.append({'period': period,'sort_desc': sort_desc,'temprature': temprature,'description': description})
        
df = pd.DataFrame(final_data) 
df

,period,sort_desc,temprature,description
0,Today,Widespread haze,70,Widespread haze. Areas of smoke between 4pm an...
1,Friday,"Mostly cloudy through mid morning, then gradua...",69,"Mostly cloudy through mid morning, then gradua..."
2,Saturday,"Mostly sunny, with a high near 65",65,"Mostly sunny, with a high near 65. Breezy, wit..."
3,Sunday,"Mostly sunny, with a high near 65",65,"Mostly sunny, with a high near 65."
4,Monday,"Mostly sunny, with a high near 66",66,"Mostly sunny, with a high near 66."
5,Tuesday,"Mostly sunny, with a high near 67",67,"Mostly sunny, with a high near 67."
6,Wednesday,"Sunny, with a high near 69",69,"Sunny, with a high near 69."

# 9. Write a python program to scrape fresher job listings from ‘https://internshala.com/’. It should include job title, company name, CTC, and apply date.

In [39]:
url = 'https://internshala.com/fresher-jobs'
pagination_base_url = 'https://internshala.com/fresher-jobs/page-'

In [40]:
is_next = True
final_list = []
i = 1

while is_next:
    

    all_body_data = get_body(url)

    all_boxs = all_body_data.find_all('div',{'class':['visibilityTrackerItem']})

    
    # Find all the data of the currecnt page
    for one_box in all_boxs:
        try:
            inner_box = one_box.find('div',{'class':['internship_meta']})

            
            other_detail_item_row = inner_box.find('div',{'class':'internship_other_details_container'}) \
                .find_all('div',{'class','other_detail_item_row'})
            
            
            job_title = inner_box.find('div',{'class':'profile'}).find('a').text
            copany_name = inner_box.find('div',{'class':'company_name'}).find('a').text.replace('\n','')
            
            ctc = other_detail_item_row[0].find_all('div',{'class':'item_body'})[1].text.replace('\n','')
            apply_date = other_detail_item_row[1].find('div',{'class':'item_body'}).text

            final_list.append({
                'job_title': job_title, 
                'copany_name': copany_name, 
                'ctc': ctc, 
                'apply_date': apply_date
            })
        except Exception as e:
            continue
            
           
    # move to the next page
    
    i += 1
    try:
        total_pages = all_body_data.find('span',{'id':'total_pages'}).text
        if int(total_pages) != i-1:        
            url = pagination_base_url + str(i)
            print('fetching:',url)
            is_next = True
        else:
            is_next = False
            
    except Exception as e:
        print(e)
        is_next = False
        
pd.DataFrame(final_list)

fetching: https://internshala.com/fresher-jobs/page-2
fetching: https://internshala.com/fresher-jobs/page-3
fetching: https://internshala.com/fresher-jobs/page-4
fetching: https://internshala.com/fresher-jobs/page-5
fetching: https://internshala.com/fresher-jobs/page-6

,job_title,copany_name,ctc,apply_date
0,OMNI SPORT LEADER,Decathlon Sport India ...,3 - 4 LPA ...,18 Sep' 21
1,Executive/Senior Executive - Partnerships,Freecharge Payments Te...,3 - 4.2 LPA ...,11 Sep' 21
2,Executive - Sales,Freecharge Payments Te...,3 - 3.5 LPA ...,11 Sep' 21
3,Junior Operations Executive,Freecharge Payments Te...,3 - 4 LPA ...,4 Sep' 21
4,Sales Manager/Omni Sport Leader - Retail,Decathlon Sport India ...,3.3 - 4.5 LPA ...,21 Aug' 21
...,...,...,...,...
212,Data & BI Consultant,CloudGarage ...,3 LPA ...,21 Aug' 21
213,Full Stack Developer,PeakMind ...,6 - 8 LPA ...,21 Aug' 21
214,Business Development Executive,Cafe Tatva Ventures LL...,3 - 5.5 LPA ...,21 Aug' 21
215,Learning Counselor - Sales,Bambinos.Live ...,3 - 3.1 LPA ...,21 Aug' 21
216,Operations Manager,Touchstone Partners ...,3 - 7 LPA ...,3 Sep' 21

# 10. Write a python program to scrape house details from https://www.nobroker.in/ for any location. It should include house title, location, area, emi and price

## Using Beautifulsoup

In [41]:
url = 'https://www.nobroker.in/property/sale/bangalore/Creditguru?searchParam=W3sibGF0IjoxMi45ODAwNzU3LCJsb24iOjc3LjUxMTQ0OTM5OTk5OTk5LCJwbGFjZUlkIjoiQ2hJSksyNDFDRFE4cmpzUnFibWt5M2V4T0V3IiwicGxhY2VOYW1lIjoiQ3JlZGl0Z3VydSIsInNob3dNYXAiOmZhbHNlfV0=&radius=2.0'

In [42]:
get_boxes = get_body(url).find_all('div',{'class':'nb__2JHKO'})

In [43]:
final_data = []
for one_box in get_boxes:
    
    house_title = one_box.find('h2').text
    location = one_box.find('div',{'class':'nb__2CMjv'}).text
    
    inner_box = one_box.find('div',{'class':'nb__17R6o'})
    
    area = inner_box.find('div',{'class':'nb__3oNyC'}).text
    emi = inner_box.find('div',{'id':'roomType'}).text
    price = inner_box.find('div',{'id':'minDeposit'}).find('span').text
    
    final_data.append({
        'house_title': house_title,
        'location': location,
        'area': area, 
        'emi': emi, 
        'price': price
    })

df = pd.DataFrame(final_data)
df

,house_title,location,area,emi,price
0,4 BHK Flat For Sale In Naagarabhaavi,"standalone building, 2nd Stage near BDA COMPLE...","3,998 sqft",₹1.6 Lacs/Month,₹2.8 Crores
1,4+ BHK In Independent House For Sale In Naga...,"Independent House, Kengeri Main Rd near BDA Co...","3,000 sqft",₹3.01 Lacs/Month,₹5.25 Crores
2,2 BHK In Independent House For Sale In Bda L...,"Independent House, 3rd Block Near BDA COMPLEX...","1,800 sqft","₹64,192/Month",₹1.12 Crores
3,2 BHK Flat For Sale In Vaibhava Apartment I...,"BDA Layout, 2nd Stage, near B.D.A. Complex",800 sqft,"₹30,949/Month",₹54 Lacs
4,2 BHK Flat For Sale In Sree Sai Park View I...,"Nagarbhavi 2nd Stage , Near BDA complex next t...",745 sqft,"₹29,803/Month",₹52 Lacs
5,4+ BHK Flat For Sale In Naagarabhaavi,"standalone building, 2nd stage,Malagala Main R...","3,000 sqft","₹63,045/Month",₹1.1 Crores
6,3 BHK Flat For Sale In Naagarabhaavi,"Standalone building, Old Outer Ring Rd near KL...","1,800 sqft","₹52,729/Month",₹92 Lacs
7,4 BHK In Independent House For Sale In Nagar...,"Independent House, 1st D Main 2nd stage, Near ...","1,800 sqft","₹68,777/Month",₹1.2 Crores
8,2 BHK In Independent House For Sale In Nagar...,"Independent House, 80 Feet Rd, Stage 2, near ...","1,200 sqft","₹65,338/Month",₹1.14 Crores
9,4+ BHK Flat For Sale In Nagarbhavi,"Standalone Building, Annapoorneshwari Nagar,ne...","4,300 sqft",₹1.55 Lacs/Month,₹2.7 Crores

## using api

In [55]:
base_api_url = 'https://www.nobroker.in/api/v1/multi/property/sale/filter?pageNo={}&searchParam=W3sibGF0IjoxMi45ODAwNzU3LCJsb24iOjc3LjUxMTQ0OTM5OTk5OTk5LCJwbGFjZUlkIjoiQ2hJSksyNDFDRFE4cmpzUnFibWt5M2V4T0V3IiwicGxhY2VOYW1lIjoiQ3JlZGl0Z3VydSJ9XQ==&radius=2.0&city=bangalore'

In [61]:
next_page = True
page_no = 1
final_data = []
while next_page:
    one_page_contetn = requests.get(base_api_url.format(page_no)).content
    one_page_json = json.loads(one_page_contetn)
    
    datas = one_page_json['data']
    
    if len(datas) == 0:
        break
    
    for data in datas:

        house_title = data['propertyTitle']
        location = data['street'] + data['locality'] + data['city']
        area = data['propertySize']
        emi = data['defaultEmi']
        price = data['price']
    
        final_data.append({
            'house_title': house_title,
            'location': location,
            'area': area, 
            'emi': emi, 
            'price': price
        })
    page_no += 1
df = pd.DataFrame(final_data)
df

,house_title,location,area,emi,price
0,4 BHK Flat For Sale In Naagarabhaavi,2nd Stage near BDA COMPLEX NAGARBHAVINaagarabh...,3998,1.6 Lacs/Month,28000000
1,4+ BHK In Independent House For Sale In Naga...,Kengeri Main Rd near BDA Complex NagarbhaviNag...,3000,3.01 Lacs/Month,52500000
2,2 BHK In Independent House For Sale In Bda L...,3rd Block Near BDA COMPLEX NAGARBHAVIBDA Layo...,1800,"64,192/Month",11200000
3,2 BHK Flat For Sale In Vaibhava Apartment I...,"BDA Layout, 2nd Stage, near B.D.A. ComplexNaga...",800,"30,949/Month",5400000
4,2 BHK Flat For Sale In Sree Sai Park View I...,"Nagarbhavi 2nd Stage , Near BDA complex next t...",745,"29,803/Month",5200000
...,...,...,...,...,...
296,1 BHK Flat For Sale In Kamakshipalya,Vrushabhavathi Nagar Near Sapthagiri Bakery An...,600,"37,254/Month",6500000
297,1 BHK Flat For Sale In Kamakshipalya,Vrushabhavathi Nagar Near Sapthagiri Bakery An...,600,"37,254/Month",6500000
298,4+ BHK Flat For Sale In Kamakshipalya,Patalamma St near to St.Lawrence English Scho...,600,"55,021/Month",9600000
299,4 BHK In Independent House For Sale In Kamak...,"Ranganathaoura, Near Ganesha TempleKamakshipal...",1650,"71,643/Month",12500000
300,"3 BHK Flat For Sale In Naagarabhaavi,",Vinayaka Layout near Aryan Presidency School N...,1800,"80,240/Month",14000000